[
  {
    "Id": "604604",
    "ThreadId": "255658",
    "Html": "\r\n<p>A really useful enhancement to this tool would be to not use JavaScript to generate the summary information.&nbsp; This would allow email delivery of the results (since obviously javascript is never executed in an email).&nbsp; In any case, since the tool\r\n generates a html file, it can very easily generate the summary information.&nbsp; I have ported the javascript code to C# and included a -nojavascript option to trx2html and this is working fine for us.&nbsp; I am happy to share the code changes I did, however\r\n I think it would be better not to need a -nojavascript option, and just do the changes to generate plain html instead.&nbsp;</p>\r\n",
    "PostedDate": "2011-04-28T20:55:02.35-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "608096",
    "ThreadId": "255658",
    "Html": "<p>faxedhead, can you share the code changes you've made? If it's not too large of changes, perhaps you can paste into this thread the changes needed, otherwise you can send it to me via email or something.</p>\r\n<p>Thanks,</p>\r\n<p>David</p>",
    "PostedDate": "2011-05-05T13:50:38.433-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "613073",
    "ThreadId": "255658",
    "Html": "<p>Latest version (0.7) does not need Javascript anymore !! And now the complete parsing is done with LINQ2HTML</p>",
    "PostedDate": "2011-05-15T16:37:19.34-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "613229",
    "ThreadId": "255658",
    "Html": "<p>Great work!&nbsp; Sorry I was going to post my code, but you beat me to it.&nbsp; I just ran 0.7 against the supplied sample report (rido_RIDOXPS 2010-04-10 00_58_47.trx) and saw that there was still some javascript in there - the togle() function.&nbsp; Showing a stack trace is probably useful in all cases, so no need to be able to toggle display of that in a test report.&nbsp; Developers want to see stack traces whenever there's a problem :)&nbsp;</p>\r\n<p>Also, are you planning to drop support for VS2008/05 completely?&nbsp; or is 0.7 just a temporary release before you migrate these no-javascript changes to those file formats as well?&nbsp; We are only using VS2010 here, but I imagine there are many others still with tests in VS2008/05...</p>\r\n<p>Thanks :)</p>",
    "PostedDate": "2011-05-16T03:31:45.18-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "613230",
    "ThreadId": "255658",
    "Html": "<p>yes you are right, I only use JS to make the show/hide of StackTraces.. &iquest;do you know other way to do it? Anyway if you do not enable JS, you can still see the summaries with bars.</p>\r\n<p>I do not think I will support older formats, the new parser is based on .Net 4.0, so I do't know if makes sense to mantain backwards compatibility, it will slow down the new functionalities I would like to add.. (sorry) however, this is an open source project, so if anyone wants to invest some time to parse old trx files...</p>",
    "PostedDate": "2011-05-16T03:36:08.003-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "617216",
    "ThreadId": "255658",
    "Html": "<p>Sorry for the delayed response.</p>\r\n<p>Regarding the remaining JS, no I don't know of any other way to do it, but my point was that hiding stack traces is probably not that useful anyway, since normally if there are any failed tests, we want to see stack traces straight away.&nbsp; So I would recommend that stack traces are always displayed.&nbsp; It's true that sometimes stack traces can be large, but they are usually no more than a dozen or so lines at most.</p>\r\n<p>Regarding support for VS2008/05, I'm surprised that moving trx2html.exe to .NET 4 should have any affect on the ability to parse VS2008/05 .trx files.&nbsp; Of course MS is able to change this file format every version of Visual Studio, and so with each new VS release there is likely to be maintenance to be done to this project to support the new version's trx files, but this should be independent of the version of .net used to build trx2html.&nbsp; even if you are using some new features in .net 4, I would have thought the logic for parsing old versions of trx files would remain intact, since .net is backwards compatible...&nbsp; I just think it's a little too early to discard VS2008/05 in 2011.&nbsp;</p>",
    "PostedDate": "2011-05-24T02:50:54.647-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]